
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.1   Copyright 1985-2019 StataCorp LLC
  Statistics/Data analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        https://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

Stata license: Single-user , expiring 31 Mar 2022
Serial number: 301609639785
  Licensed to: Matthew McKay
               Australian National University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.

. do /Users/matthewmckay/.ipython/stata/code.do 

. clear

. set more off

. set linesize 200

. use "/Users/matthewmckay/.ipython/stata/data_input.dta", clear 

. log using "/Users/matthewmckay/.ipython/stata/log_output.log", text replace
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/matthewmckay/.ipython/stata/log_output.log
  log type:  text
 opened on:  30 Mar 2021, 15:52:05

. 
. #Exporter Dummies
Unknown #command
. encode iso3_o, g(iso3o)

. gen levalue = ln(evalue)
(1,282 missing values generated)

. gen lgdp_o = ln(gdp_o)
(771 missing values generated)

. gen lgdp_d = ln(gdp_d)
(412 missing values generated)

. gen ldist = ln(dist)

. reg levalue lgdp_o lgdp_d ldist i.iso3o
note: 194.iso3o omitted because of collinearity

      Source |       SS           df       MS      Number of obs   =    20,334
-------------+----------------------------------   F(187, 20146)   =    276.19
       Model |  299971.916       187   1604.1279   Prob > F        =    0.0000
    Residual |  117011.029    20,146  5.80815194   R-squared       =    0.7194
-------------+----------------------------------   Adj R-squared   =    0.7168
       Total |  416982.945    20,333  20.5076942   Root MSE        =      2.41

------------------------------------------------------------------------------
     levalue |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      lgdp_o |  -5.042138   .7786165    -6.48   0.000     -6.56829   -3.515986
      lgdp_d |   1.069977   .0077948   137.27   0.000     1.054699    1.085256
       ldist |  -1.615335   .0223823   -72.17   0.000    -1.659206   -1.571464
             |
       iso3o |
        AGO  |   11.05963   1.598226     6.92   0.000     7.926976    14.19228
        ALB  |  -1.742451   .3394323    -5.13   0.000    -2.407766   -1.077136
        ARE  |   21.87755   2.500108     8.75   0.000     16.97714    26.77797
        ARG  |   24.71347   2.822661     8.76   0.000     19.18082    30.24612
        ARM  |  -3.885121   .4596593    -8.45   0.000     -4.78609   -2.984151
        ATG  |  -14.83986   2.062481    -7.20   0.000    -18.88249   -10.79723
        AUS  |   30.18919   3.551557     8.50   0.000     23.22785    37.15053
        AUT  |   21.63964     2.5485     8.49   0.000     16.64437     26.6349
        AZE  |   7.653772   1.199453     6.38   0.000     5.302747     10.0048
        BDI  |  -11.33967   1.445914    -7.84   0.000    -14.17378   -8.505557
        BEL  |   23.98406     2.7058     8.86   0.000     18.68047    29.28765
        BEN  |  -4.643133   .6168623    -7.53   0.000    -5.852233   -3.434032
        BFA  |  -2.811096   .4102759    -6.85   0.000     -3.61527   -2.006922
        BGD  |   15.43217   1.738228     8.88   0.000      12.0251    18.83924
        BGR  |   9.587595   .9660162     9.92   0.000     7.694124    11.48107
        BHR  |   4.735007    .604358     7.83   0.000     3.550415    5.919598
        BHS  |  -3.167081   .5975368    -5.30   0.000    -4.338302    -1.99586
        BIH  |   .9746409   .2800431     3.48   0.001     .4257336    1.523548
        BLR  |   9.643465   1.176052     8.20   0.000     7.338306    11.94862
        BLZ  |  -11.46721   1.827296    -6.28   0.000    -15.04886   -7.885555
        BMU  |  -8.081657   .9019897    -8.96   0.000     -9.84963   -6.313683
        BOL  |   4.756934   .5613652     8.47   0.000     3.656612    5.857256
        BRA  |   32.54479    3.83422     8.49   0.000     25.02941    40.06018
        BRB  |  -7.299018   1.074733    -6.79   0.000    -9.405582   -5.192453
        BRN  |  -1.302636   .2970344    -4.39   0.000    -1.884847   -.7204238
        BTN  |  -15.02623   1.767219    -8.50   0.000    -18.49012   -11.56233
        BWA  |  -2.064316   .3192102    -6.47   0.000    -2.689994   -1.438638
        CAF  |  -14.53412    1.87307    -7.76   0.000    -18.20549   -10.86275
        CAN  |   30.78584    3.67381     8.38   0.000     23.58487    37.98681
        CHE  |   25.30237   2.912766     8.69   0.000     19.59311    31.01163
        CHL  |   19.76205   2.212314     8.93   0.000     15.42574    24.09837
        CHN  |   41.91487   4.933534     8.50   0.000     32.24474      51.585
        CIV  |   5.480383   .5632459     9.73   0.000     4.376375    6.584391
        CMR  |   4.405507   .5288445     8.33   0.000     3.368929    5.442086
        COG  |  -.6105562   .3089137    -1.98   0.048    -1.216052   -.0050602
        COL  |   20.14877   2.453085     8.21   0.000     15.34053    24.95702
        COM  |  -19.09135   2.601501    -7.34   0.000    -24.19051    -13.9922
        CPV  |  -13.82455   1.720572    -8.03   0.000    -17.19701   -10.45209
        CRI  |   9.356245    .897174    10.43   0.000      7.59771    11.11478
        CUB  |   9.647451    1.23048     7.84   0.000     7.235609    12.05929
        CYP  |   3.254159   .3449949     9.43   0.000      2.57794    3.930377
        CZE  |   17.41091   1.993129     8.74   0.000     13.50422    21.31761
        DEU  |   35.38713   4.228242     8.37   0.000     27.09943    43.67483
        DJI  |  -14.33114   1.915126    -7.48   0.000    -18.08495   -10.57734
        DMA  |  -19.20677   2.713756    -7.08   0.000    -24.52595   -13.88758
        DNK  |   20.93213   2.360167     8.87   0.000     16.30601    25.55825
        DOM  |   8.950855    1.05537     8.48   0.000     6.882243    11.01947
        DZA  |   14.46668   2.000447     7.23   0.000     10.54564    18.38772
        ECU  |   12.55046   1.384054     9.07   0.000     9.837596    15.26331
        EGY  |   18.31614    2.19706     8.34   0.000     14.00972    22.62256
        ERI  |  -11.24652   1.262141    -8.91   0.000    -13.72042   -8.772618
        ESP  |   29.01098   3.463135     8.38   0.000     22.22295    35.79901
        EST  |   4.580221   .4169646    10.98   0.000     3.762936    5.397506
        ETH  |    6.18772   .8669331     7.14   0.000     4.488461     7.88698
        FIN  |   19.15091   2.183893     8.77   0.000      14.8703    23.43152
        FJI  |  -7.209228   1.171406    -6.15   0.000     -9.50528   -4.913176
        FRA  |   33.34742    4.00715     8.32   0.000     25.49308    41.20176
        FRO  |  -10.56542   1.474771    -7.16   0.000     -13.4561   -7.674753
        FSM  |  -22.63687   3.101952    -7.30   0.000    -28.71695   -16.55679
        GAB  |   1.311609   .3048301     4.30   0.000     .7141168    1.909101
        GBR  |   32.86457   3.970824     8.28   0.000     25.08143    40.64771
        GEO  |   .9450488   .2715113     3.48   0.001     .4128645    1.477233
        GHA  |   7.787716   .8753046     8.90   0.000     6.072047    9.503385
        GIN  |  -5.525191   .8242558    -6.70   0.000    -7.140799   -3.909582
        GMB  |  -17.25473   2.281934    -7.56   0.000     -21.7275   -12.78195
        GNB  |  -17.62138   2.243312    -7.86   0.000    -22.01846   -13.22431
        GNQ  |  -.3516396     .35251    -1.00   0.319    -1.042588    .3393088
        GRC  |   17.13906   2.107614     8.13   0.000     13.00796    21.27015
        GRD  |  -17.69251   2.346419    -7.54   0.000    -22.29169   -13.09334
        GRL  |  -11.56867   1.513777    -7.64   0.000     -14.5358   -8.601546
        GTM  |   9.150234   .9589931     9.54   0.000     7.270529    11.02994
        GUY  |  -9.104658   1.364181    -6.67   0.000    -11.77856   -6.430752
        HKG  |   20.32232   2.202816     9.23   0.000     16.00462    24.64002
        HND  |    2.75872    .282424     9.77   0.000     2.205146    3.312294
        HRV  |   7.981966   1.013433     7.88   0.000     5.995554    9.968378
        HTI  |  -4.329773   .5921164    -7.31   0.000    -5.490369   -3.169176
        HUN  |   14.75291   1.647963     8.95   0.000     11.52277    17.98306
        IDN  |    27.1689   3.096424     8.77   0.000     21.09966    33.23815
        IND  |   31.57849   3.694662     8.55   0.000     24.33665    38.82033
        IRL  |   18.78001   2.074565     9.05   0.000      14.7137    22.84633
        IRN  |   18.29462   2.433377     7.52   0.000       13.525    23.06424
        IRQ  |    12.7777     2.0705     6.17   0.000     8.719354    16.83605
        ISL  |   1.293034   .2741465     4.72   0.000     .7556842    1.830383
        ISR  |   19.05082   2.248927     8.47   0.000     14.64273     23.4589
        ITA  |   31.76575   3.799961     8.36   0.000     24.31751    39.21398
        JAM  |  -.1876416   .2924451    -0.64   0.521    -.7608578    .3855747
        JOR  |   5.215984   .6161384     8.47   0.000     4.008302    6.423666
        JPN  |    37.5494   4.443563     8.45   0.000     28.83965    46.25915
        KAZ  |    15.9465   2.077955     7.67   0.000     11.87354    20.01946
        KEN  |     8.3286   .9768374     8.53   0.000     6.413918    10.24328
        KGZ  |  -5.968845   .7097378    -8.41   0.000    -7.359989   -4.577701
        KHM  |   2.650601   .2758966     9.61   0.000     2.109821    3.191381
        KIR  |  -25.53648   3.589934    -7.11   0.000    -32.57305   -18.49992
        KNA  |  -18.23639   2.414148    -7.55   0.000    -22.96832   -13.50446
        KOR  |   30.12133   3.412404     8.83   0.000     23.43273    36.80992
        KWT  |   13.65754   1.862259     7.33   0.000     10.00736    17.30772
        LAO  |  -1.963682   .4165164    -4.71   0.000    -2.780088   -1.147276
        LBN  |   6.691061   .8137198     8.22   0.000     5.096104    8.286018
        LBR  |   -11.0661   1.688774    -6.55   0.000    -14.37623   -7.755966
        LBY  |   8.131747   1.208827     6.73   0.000     5.762348    10.50115
        LCA  |  -16.09676   1.991433    -8.08   0.000    -20.00013   -12.19339
        LKA  |   10.93398   1.124061     9.73   0.000     8.730731    13.13723
        LSO  |  -11.67909   1.554377    -7.51   0.000    -14.72579    -8.63238
        LTU  |    8.10523   .8399388     9.65   0.000     6.458881    9.751578
        LUX  |   9.327073   1.041503     8.96   0.000     7.285642     11.3685
        LVA  |   5.304785   .5591091     9.49   0.000     4.208886    6.400685
        MAC  |    5.85321   .9337324     6.27   0.000     4.023018    7.683402
        MAR  |   12.97454   1.455724     8.91   0.000      10.1212    15.82788
        MDA  |  -3.527774    .639076    -5.52   0.000    -4.780415   -2.275133
        MDG  |  -.9958756   .4396284    -2.27   0.024    -1.857583    -.134168
        MDV  |  -11.70867   1.568487    -7.46   0.000    -14.78303   -8.634306
        MEX  |   28.07294   3.386104     8.29   0.000      21.4359    34.70999
        MHL  |  -23.22363   3.488438    -6.66   0.000    -30.06125   -16.38601
        MKD  |   -1.95157   .4771535    -4.09   0.000     -2.88683    -1.01631
        MLI  |  -2.949692   .4228719    -6.98   0.000    -3.778555   -2.120828
        MLT  |  -1.222829   .4980132    -2.46   0.014    -2.198975   -.2466822
        MMR  |   8.126861   1.046134     7.77   0.000     6.076353    10.17737
        MNG  |  -3.104915   .4141427    -7.50   0.000    -3.916668   -2.293161
        MNP  |  -18.66085   2.414578    -7.73   0.000    -23.39362   -13.92808
        MOZ  |   1.500512   .2900372     5.17   0.000     .9320149    2.069008
        MRT  |  -7.631103   1.109361    -6.88   0.000    -9.805541   -5.456664
        MUS  |   .5122425   .3695337     1.39   0.166    -.2120738    1.236559
        MWI  |  -6.920805    1.19769    -5.78   0.000    -9.268375   -4.573234
        MYS  |   21.93204   2.306027     9.51   0.000     17.41204    26.45204
        NAM  |   .1581695   .3273192     0.48   0.629    -.4834029    .7997419
        NER  |  -5.937004    .686407    -8.65   0.000    -7.282418    -4.59159
        NGA  |   20.23479   2.702269     7.49   0.000     14.93813    25.53146
        NIC  |  -.7857718   .4033295    -1.95   0.051    -1.576331     .004787
        NLD  |   26.85354   3.082957     8.71   0.000     20.81069    32.89639
        NOR  |   22.00037   2.687783     8.19   0.000      16.7321    27.26864
        NPL  |   .1608319   .3048254     0.53   0.598    -.4366508    .7583145
        NZL  |   18.32798   1.902961     9.63   0.000     14.59802    22.05794
        OMN  |   10.37298   1.254244     8.27   0.000     7.914563    12.83141
        PAK  |   18.28324   2.075171     8.81   0.000     14.21574    22.35075
        PAN  |   7.821672   .7859675     9.95   0.000     6.281111    9.362232
        PER  |   16.86534   1.969023     8.57   0.000     13.00589    20.72478
        PHL  |   19.17555   2.197465     8.73   0.000     14.86834    23.48276
        PLW  |  -25.63967   3.300864    -7.77   0.000    -32.10963    -19.1697
        PNG  |   .2587833   .3083032     0.84   0.401    -.3455161    .8630827
        POL  |   22.75304   2.707637     8.40   0.000     17.44585    28.06023
        PRT  |   18.10363   2.058662     8.79   0.000     14.06849    22.13878
        PRY  |   5.619447   .5201472    10.80   0.000     4.599916    6.638978
        QAT  |   16.03848    1.97307     8.13   0.000      12.1711    19.90586
        RUS  |   30.61268   3.780949     8.10   0.000     23.20171    38.02365
        RWA  |  -5.520245   .6888866    -8.01   0.000    -6.870519    -4.16997
        SAU  |    24.2119   2.981228     8.12   0.000     18.36845    30.05535
        SDN  |   7.251258   1.121472     6.47   0.000     5.053082    9.449435
        SEN  |   .0432701    .281979     0.15   0.878    -.5094318    .5959719
        SGP  |   21.38522   2.267638     9.43   0.000     16.94047    25.82998
        SLB  |  -14.42878   2.141296    -6.74   0.000    -18.62589   -10.23166
        SLE  |  -7.241936   1.113534    -6.50   0.000    -9.424552   -5.059319
        SLV  |   3.133453   .4143045     7.56   0.000     2.321383    3.945524
        SOM  |  -8.072555   .9374348    -8.61   0.000    -9.910004   -6.235106
        STP  |  -23.81586   3.113291    -7.65   0.000    -29.91816   -17.71355
        SUR  |  -6.537579   .9316842    -7.02   0.000    -8.363756   -4.711402
        SVK  |   12.32031   1.409348     8.74   0.000     9.557868    15.08274
        SVN  |   8.446226   .8723348     9.68   0.000     6.736378    10.15607
        SWE  |   23.95929   2.782954     8.61   0.000     18.50447     29.4141
        SWZ  |   -5.95796   1.177689    -5.06   0.000    -8.266326   -3.649594
        SYC  |  -12.35826   1.918797    -6.44   0.000    -16.11926   -8.597262
        TCD  |  -3.201763     .36594    -8.75   0.000    -3.919035    -2.48449
        TGO  |  -7.288105   1.083917    -6.72   0.000    -9.412671   -5.163538
        THA  |   23.39687   2.470442     9.47   0.000      18.5546    28.23914
        TJK  |  -5.531714   .6068551    -9.12   0.000      -6.7212   -4.342228
        TKM  |   3.618205   .7895911     4.58   0.000     2.070542    5.165868
        TON  |  -21.28326   2.800573    -7.60   0.000    -26.77261   -15.79391
        TTO  |   3.236659   .4188839     7.73   0.000     2.415612    4.057706
        TUN  |   7.996008   .8558459     9.34   0.000      6.31848    9.673536
        TUR  |   25.85851   3.053877     8.47   0.000     19.87266    31.84436
        TUV  |  -33.92322   4.739227    -7.16   0.000    -43.21249   -24.63394
        TZA  |   5.314881   .6082497     8.74   0.000     4.122662      6.5071
        UGA  |   1.982016   .3417679     5.80   0.000     1.312123    2.651909
        UKR  |   16.60517   1.867689     8.89   0.000     12.94434    20.26599
        URY  |   10.19734   .9832984    10.37   0.000     8.269991    12.12468
        USA  |   44.42826   5.396981     8.23   0.000     33.84974    55.00679
        UZB  |   6.941393   1.007308     6.89   0.000     4.966987      8.9158
        VCT  |  -18.80242   2.474367    -7.60   0.000    -23.65238   -13.95246
        VEN  |   18.46509   2.567733     7.19   0.000     13.43213    23.49806
        VNM  |   18.47572   1.840649    10.04   0.000      14.8679    22.08354
        VUT  |  -16.69074   2.355827    -7.08   0.000    -21.30835   -12.07313
        WSM  |  -17.32885   2.382164    -7.27   0.000    -21.99809   -12.65961
        YEM  |    3.73487   .6778053     5.51   0.000     2.406316    5.063423
        ZAF  |   21.71246   2.393479     9.07   0.000     17.02104    26.40387
        ZMB  |   2.833505   .4762743     5.95   0.000     1.899969    3.767041
        ZWE  |          0  (omitted)
             |
       _cons |   90.41858   12.94519     6.98   0.000     65.04494    115.7922
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/matthewmckay/.ipython/stata/log_output.log
  log type:  text
 closed on:  30 Mar 2021, 15:52:05
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. // End of line deletion prevention
. 
end of do-file
